app/controllers/admin_user_controller.rb

  def create
    @admin_user = AdminUser.new(params[:admin_user])
    if @admin_user.save
---
INSERT INTO `admin_users` (`first_name`, `last_name`, `email`, `hashed_password`, `salt`, `username`, `created_at`, `updated_at`) VALUES ('TestingThis', 'TestingThis', 'something@something.com', 'afa506651cbcabdb892c0e149ad77accc0bffcfc', 'ef4c6246fdd573c246130f02556d0d3d74beb5cb', 'testingtesting', '2011-08-15 18:52:34', '2011-08-15 18:52:34')

  def edit
    @admin_user = AdminUser.find(params[:id])
---
SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1

  def update
    @admin_user = AdminUser.find(params[:id])
---
SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1

  def delete
    @admin_user = AdminUser.find(params[:id])
---
SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1

  def destroy
    AdminUser.find(params[:id]).destroy
---
DELETE FROM `admin_users` WHERE `admin_users`.`id` = 2
SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 2 LIMIT 1