app/controllers/special_controller.rb

INSERT INTO `specials` (`day`, `special`, `price`, `created_at`, `updated_at`) VALUES ('Wednesday', 'BLT Grilled Chicken / El Paso BBQ Salad', '$5.00', '2011-08-10 02:34:27', '2011-08-10 02:34:27')
---
  def create
    @special = Special.new(params[:special])
    if @special.save

SELECT `specials`.* FROM `specials` WHERE `specials`.`id` = 1 LIMIT 1
---
  def edit
    @special = Special.find(params[:id])

SELECT `specials`.* FROM `specials` WHERE `specials`.`id` = 2 LIMIT 1
UPDATE `specials` SET `special` = 'Grilled Cheese and Tomato Basil Soup ddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd', `updated_at` = '2011-08-13 03:42:26' WHERE `specials`.`id` = 5
---
  def update
    @special = Special.find(params[:id])
    if @special.update_attributes(params[:special])

SELECT `specials`.* FROM `specials` WHERE `specials`.`id` = 2 LIMIT 1
---
  def delete
    @special = Special.find(params[:id])

DELETE FROM `specials` WHERE `specials`.`id` = 5
SELECT `specials`.* FROM `specials` WHERE `specials`.`id` = 5 LIMIT 1
---
  def destroy
    Special.find(params[:id]).destroy