app/views/special/list.html.erb


  <div class="found"><%= pluralize(@special.size, 'special') %> found</div>
---
SELECT COUNT(*) FROM `specials`
SELECT `specials`.* FROM `specials` ORDER BY specials.id ASC